#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```terraform

Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/initialised-si/JoWe-Web/runs/run-CzuZGRFAdXYbbdPd

Waiting for the plan to start...

Terraform v1.4.2
on linux_amd64
Initializing plugins and modules...
module.web.aws_cloudfront_origin_access_identity.jowe_web: Refreshing state... [id=E5VWR9I7KGZSJ]
module.web.aws_s3_bucket.jowe_web: Refreshing state... [id=jowe.initialised.si]
module.web.aws_s3_bucket_ownership_controls.jowe_web: Refreshing state... [id=jowe.initialised.si]
module.web.aws_s3_bucket_public_access_block.jowe_web: Refreshing state... [id=jowe.initialised.si]
module.web.data.aws_iam_policy_document.jowe_web_s3_policy: Refreshing...
module.web.aws_s3_bucket_versioning.jowe_web: Refreshing state... [id=jowe.initialised.si]
module.web.data.aws_iam_policy_document.jowe_web_s3_policy: Refresh complete after 0s [id=1920302536]
module.web.aws_s3_bucket_policy.jowe_web: Refreshing state... [id=jowe.initialised.si]
module.web.aws_cloudfront_distribution.jowe_web: Refreshing state... [id=E3PO6D275Y4WSU]
module.web.aws_s3_bucket_acl.jowe_web: Refreshing state... [id=jowe.initialised.si,private]
module.web.aws_s3_object.upload_webapp["static/js/main.ed7dfa3d.js.map"]: Refreshing state... [id=static/js/main.ed7dfa3d.js.map]
module.web.aws_s3_object.upload_webapp["static/js/726.e869980a.chunk.js"]: Refreshing state... [id=static/js/726.e869980a.chunk.js]
module.web.aws_s3_object.upload_webapp["static/js/698.1c688865.chunk.js.map"]: Refreshing state... [id=static/js/698.1c688865.chunk.js.map]
module.web.aws_s3_object.upload_webapp["static/js/496.099941b1.chunk.js.map"]: Refreshing state... [id=static/js/496.099941b1.chunk.js.map]
module.web.aws_s3_object.upload_webapp["static/media/anonymous-female.9d832d02f50e90f40bbe.jpg"]: Refreshing state... [id=static/media/anonymous-female.9d832d02f50e90f40bbe.jpg]
module.web.aws_s3_object.upload_webapp["static/js/777.beec4e33.chunk.js.map"]: Refreshing state... [id=static/js/777.beec4e33.chunk.js.map]
module.web.aws_s3_object.upload_webapp["static/js/924.d545cbce.chunk.js.map"]: Refreshing state... [id=static/js/924.d545cbce.chunk.js.map]
module.web.aws_s3_object.upload_webapp["index.html"]: Refreshing state... [id=index.html]
module.web.aws_s3_object.upload_webapp["static/js/915.45e13d48.chunk.js"]: Refreshing state... [id=static/js/915.45e13d48.chunk.js]
module.web.aws_s3_object.upload_webapp["static/css/777.2911c3c0.chunk.css.map"]: Refreshing state... [id=static/css/777.2911c3c0.chunk.css.map]
module.web.aws_s3_object.upload_webapp["static/css/915.995481a0.chunk.css"]: Refreshing state... [id=static/css/915.995481a0.chunk.css]
module.web.aws_s3_object.upload_webapp["static/js/main.ed7dfa3d.js.LICENSE.txt"]: Refreshing state... [id=static/js/main.ed7dfa3d.js.LICENSE.txt]
module.web.aws_s3_object.upload_webapp["static/css/main.1990866e.css"]: Refreshing state... [id=static/css/main.1990866e.css]
module.web.aws_s3_object.upload_webapp["favicon.ico"]: Refreshing state... [id=favicon.ico]
module.web.aws_s3_object.upload_webapp["static/js/main.ed7dfa3d.js"]: Refreshing state... [id=static/js/main.ed7dfa3d.js]
module.web.aws_s3_object.upload_webapp["static/css/main.1990866e.css.map"]: Refreshing state... [id=static/css/main.1990866e.css.map]
module.web.aws_s3_object.upload_webapp["manifest.json"]: Refreshing state... [id=manifest.json]
module.web.aws_s3_object.upload_webapp["static/js/777.beec4e33.chunk.js"]: Refreshing state... [id=static/js/777.beec4e33.chunk.js]
module.web.aws_s3_object.upload_webapp["asset-manifest.json"]: Refreshing state... [id=asset-manifest.json]
module.web.aws_s3_object.upload_webapp["static/js/106.44e68525.chunk.js"]: Refreshing state... [id=static/js/106.44e68525.chunk.js]
module.web.aws_s3_object.upload_webapp["static/css/106.2911c3c0.chunk.css.map"]: Refreshing state... [id=static/css/106.2911c3c0.chunk.css.map]
module.web.aws_s3_object.upload_webapp["static/js/924.d545cbce.chunk.js"]: Refreshing state... [id=static/js/924.d545cbce.chunk.js]
module.web.aws_s3_object.upload_webapp["static/js/726.e869980a.chunk.js.map"]: Refreshing state... [id=static/js/726.e869980a.chunk.js.map]
module.web.aws_s3_object.upload_webapp["static/css/106.2911c3c0.chunk.css"]: Refreshing state... [id=static/css/106.2911c3c0.chunk.css]
module.web.aws_s3_object.upload_webapp["static/js/356.2a621892.chunk.js"]: Refreshing state... [id=static/js/356.2a621892.chunk.js]
module.web.aws_s3_object.upload_webapp["static/css/777.2911c3c0.chunk.css"]: Refreshing state... [id=static/css/777.2911c3c0.chunk.css]
module.web.aws_s3_object.upload_webapp["static/js/356.2a621892.chunk.js.LICENSE.txt"]: Refreshing state... [id=static/js/356.2a621892.chunk.js.LICENSE.txt]
module.web.aws_s3_object.upload_webapp["static/js/496.099941b1.chunk.js"]: Refreshing state... [id=static/js/496.099941b1.chunk.js]
module.web.aws_s3_object.upload_webapp["static/js/106.44e68525.chunk.js.map"]: Refreshing state... [id=static/js/106.44e68525.chunk.js.map]
module.web.aws_s3_object.upload_webapp["static/css/915.995481a0.chunk.css.map"]: Refreshing state... [id=static/css/915.995481a0.chunk.css.map]
module.web.aws_s3_object.upload_webapp["static/js/698.1c688865.chunk.js"]: Refreshing state... [id=static/js/698.1c688865.chunk.js]
module.web.aws_s3_object.upload_webapp["static/media/anonymous-male.a323776dc6f4f8a3ceb8.jpg"]: Refreshing state... [id=static/media/anonymous-male.a323776dc6f4f8a3ceb8.jpg]
module.web.aws_s3_object.upload_webapp["static/js/356.2a621892.chunk.js.map"]: Refreshing state... [id=static/js/356.2a621892.chunk.js.map]
module.web.aws_s3_object.upload_webapp["static/js/915.45e13d48.chunk.js.map"]: Refreshing state... [id=static/js/915.45e13d48.chunk.js.map]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # module.web.aws_s3_object.upload_webapp["asset-manifest.json"] will be updated in-place
  ~ resource "aws_s3_object" "upload_webapp" {
      ~ etag                   = "1af7f9274578f18e214d1bae2866806e" -> "c92747056fc498ea0ba50e2ba10388c1"
        id                     = "asset-manifest.json"
        tags                   = {}
      ~ version_id             = "Z8OVZa4dA7bGCTYFPIktUdaLqgTorAfX" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.web.aws_s3_object.upload_webapp["index.html"] will be updated in-place
  ~ resource "aws_s3_object" "upload_webapp" {
      ~ etag                   = "369a39f53a2f8be78439e187c5050f00" -> "adf96ed1a884d427e3fdd60ec949e116"
        id                     = "index.html"
        tags                   = {}
      ~ version_id             = "CT8ZGV_gqZZ9pqqpHB4xQl2NuG9gUqEf" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.web.aws_s3_object.upload_webapp["static/css/106.2911c3c0.chunk.css"] will be destroyed
  # (because key ["static/css/106.2911c3c0.chunk.css"] is not in for_each map)
  - resource "aws_s3_object" "upload_webapp" {
      - bucket                 = "jowe.initialised.si" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "text/css; charset=utf-8" -> null
      - etag                   = "4a2cfc3a0cee5dc08b0d0e0968952dbe" -> null
      - force_destroy          = false -> null
      - id                     = "static/css/106.2911c3c0.chunk.css" -> null
      - key                    = "static/css/106.2911c3c0.chunk.css" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./build//static/css/106.2911c3c0.chunk.css" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - version_id             = "ClutAdokouRft0YIh3k7cy4C7FvV66uz" -> null
    }

  # module.web.aws_s3_object.upload_webapp["static/css/106.2911c3c0.chunk.css.map"] will be destroyed
  # (because key ["static/css/106.2911c3c0.chunk.css.map"] is not in for_each map)
  - resource "aws_s3_object" "upload_webapp" {
      - bucket                 = "jowe.initialised.si" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "application/octet-stream" -> null
      - etag                   = "5aeb9b46eb1137103eb56b5145b1e348" -> null
      - force_destroy          = false -> null
      - id                     = "static/css/106.2911c3c0.chunk.css.map" -> null
      - key                    = "static/css/106.2911c3c0.chunk.css.map" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./build//static/css/106.2911c3c0.chunk.css.map" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - version_id             = "So6rIZ5YXSqT2zuU8oTKejCQB1ZJStek" -> null
    }

  # module.web.aws_s3_object.upload_webapp["static/css/106.872b5878.chunk.css"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + bucket                 = "jowe.initialised.si"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "text/css; charset=utf-8"
      + etag                   = "46285113d0bb2f0e3a0379312c745d30"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/css/106.872b5878.chunk.css"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/css/106.872b5878.chunk.css"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.web.aws_s3_object.upload_webapp["static/css/106.872b5878.chunk.css.map"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + bucket                 = "jowe.initialised.si"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "51df6f56e277df51b0c07bd8f95368a3"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/css/106.872b5878.chunk.css.map"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/css/106.872b5878.chunk.css.map"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.web.aws_s3_object.upload_webapp["static/css/777.2911c3c0.chunk.css"] will be destroyed
  # (because key ["static/css/777.2911c3c0.chunk.css"] is not in for_each map)
  - resource "aws_s3_object" "upload_webapp" {
      - bucket                 = "jowe.initialised.si" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "text/css; charset=utf-8" -> null
      - etag                   = "0248941ab28d2cf4937eaa3d18bb39a7" -> null
      - force_destroy          = false -> null
      - id                     = "static/css/777.2911c3c0.chunk.css" -> null
      - key                    = "static/css/777.2911c3c0.chunk.css" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./build//static/css/777.2911c3c0.chunk.css" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - version_id             = "QTHgh0caRmN5hJq1j9BIQTC3DMjnkOws" -> null
    }

  # module.web.aws_s3_object.upload_webapp["static/css/777.2911c3c0.chunk.css.map"] will be destroyed
  # (because key ["static/css/777.2911c3c0.chunk.css.map"] is not in for_each map)
  - resource "aws_s3_object" "upload_webapp" {
      - bucket                 = "jowe.initialised.si" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "application/octet-stream" -> null
      - etag                   = "70d67bff00795d28fb1756eb61aab15c" -> null
      - force_destroy          = false -> null
      - id                     = "static/css/777.2911c3c0.chunk.css.map" -> null
      - key                    = "static/css/777.2911c3c0.chunk.css.map" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./build//static/css/777.2911c3c0.chunk.css.map" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - version_id             = "eYCcwnegKFf7NWFlG8lieBhkjX8boc_x" -> null
    }

  # module.web.aws_s3_object.upload_webapp["static/css/777.872b5878.chunk.css"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + bucket                 = "jowe.initialised.si"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "text/css; charset=utf-8"
      + etag                   = "4c7cb1a7f8796dab59ac62aa3b6246b0"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/css/777.872b5878.chunk.css"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/css/777.872b5878.chunk.css"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.web.aws_s3_object.upload_webapp["static/css/777.872b5878.chunk.css.map"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + bucket                 = "jowe.initialised.si"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "dc64abd5956a9dabb5d11de8b07dc20b"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/css/777.872b5878.chunk.css.map"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/css/777.872b5878.chunk.css.map"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.web.aws_s3_object.upload_webapp["static/css/915.35ba84bd.chunk.css"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + bucket                 = "jowe.initialised.si"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "text/css; charset=utf-8"
      + etag                   = "6c2fd5590c5c2513ecfd992d627816ed"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/css/915.35ba84bd.chunk.css"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/css/915.35ba84bd.chunk.css"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.web.aws_s3_object.upload_webapp["static/css/915.35ba84bd.chunk.css.map"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + bucket                 = "jowe.initialised.si"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "d798a776ea1cf5ed12376c4af3cac80f"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/css/915.35ba84bd.chunk.css.map"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/css/915.35ba84bd.chunk.css.map"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.web.aws_s3_object.upload_webapp["static/css/915.995481a0.chunk.css"] will be destroyed
  # (because key ["static/css/915.995481a0.chunk.css"] is not in for_each map)
  - resource "aws_s3_object" "upload_webapp" {
      - bucket                 = "jowe.initialised.si" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "text/css; charset=utf-8" -> null
      - etag                   = "4920b3ec97b88076bcfede9935149d72" -> null
      - force_destroy          = false -> null
      - id                     = "static/css/915.995481a0.chunk.css" -> null
      - key                    = "static/css/915.995481a0.chunk.css" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./build//static/css/915.995481a0.chunk.css" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - version_id             = "BG4sYiwBH6cfyk6JnuwzysCkIyPbNt4P" -> null
    }

  # module.web.aws_s3_object.upload_webapp["static/css/915.995481a0.chunk.css.map"] will be destroyed
  # (because key ["static/css/915.995481a0.chunk.css.map"] is not in for_each map)
  - resource "aws_s3_object" "upload_webapp" {
      - bucket                 = "jowe.initialised.si" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "application/octet-stream" -> null
      - etag                   = "4ae3d25790ffd5ceb3cd89b35989db49" -> null
      - force_destroy          = false -> null
      - id                     = "static/css/915.995481a0.chunk.css.map" -> null
      - key                    = "static/css/915.995481a0.chunk.css.map" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./build//static/css/915.995481a0.chunk.css.map" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - version_id             = "ed2IV40FKrh_4_ePqth6vSqtqIu5uZa1" -> null
    }

  # module.web.aws_s3_object.upload_webapp["static/css/main.1990866e.css"] will be destroyed
  # (because key ["static/css/main.1990866e.css"] is not in for_each map)
  - resource "aws_s3_object" "upload_webapp" {
      - bucket                 = "jowe.initialised.si" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "text/css; charset=utf-8" -> null
      - etag                   = "11270d1b67f0ff3d6749d555d9f52b8f" -> null
      - force_destroy          = false -> null
      - id                     = "static/css/main.1990866e.css" -> null
      - key                    = "static/css/main.1990866e.css" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./build//static/css/main.1990866e.css" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - version_id             = "SnXT8ciQsgMMNaC8d8ByJAYL9PKdESKp" -> null
    }

  # module.web.aws_s3_object.upload_webapp["static/css/main.1990866e.css.map"] will be destroyed
  # (because key ["static/css/main.1990866e.css.map"] is not in for_each map)
  - resource "aws_s3_object" "upload_webapp" {
      - bucket                 = "jowe.initialised.si" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "application/octet-stream" -> null
      - etag                   = "381348c9ffb4517f5401dfad980a619c" -> null
      - force_destroy          = false -> null
      - id                     = "static/css/main.1990866e.css.map" -> null
      - key                    = "static/css/main.1990866e.css.map" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./build//static/css/main.1990866e.css.map" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - version_id             = "X0a4D20vUevfw06XCPnPDM2Iu.T_PboF" -> null
    }

  # module.web.aws_s3_object.upload_webapp["static/css/main.f04d7010.css"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + bucket                 = "jowe.initialised.si"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "text/css; charset=utf-8"
      + etag                   = "1fbfde3896910e5d368fa2c3a8cd72a2"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/css/main.f04d7010.css"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/css/main.f04d7010.css"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.web.aws_s3_object.upload_webapp["static/css/main.f04d7010.css.map"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + bucket                 = "jowe.initialised.si"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "b8ebc3f0c5f3fecd0aa00b77184b993d"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/css/main.f04d7010.css.map"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/css/main.f04d7010.css.map"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.web.aws_s3_object.upload_webapp["static/js/106.44e68525.chunk.js"] will be destroyed
  # (because key ["static/js/106.44e68525.chunk.js"] is not in for_each map)
  - resource "aws_s3_object" "upload_webapp" {
      - bucket                 = "jowe.initialised.si" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "60bec55454ffb74d21f84973ce4594ce" -> null
      - force_destroy          = false -> null
      - id                     = "static/js/106.44e68525.chunk.js" -> null
      - key                    = "static/js/106.44e68525.chunk.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./build//static/js/106.44e68525.chunk.js" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - version_id             = "l8dAZ2Vn26M1shXdTx.BfXyfvm_aiEtJ" -> null
    }

  # module.web.aws_s3_object.upload_webapp["static/js/106.44e68525.chunk.js.map"] will be destroyed
  # (because key ["static/js/106.44e68525.chunk.js.map"] is not in for_each map)
  - resource "aws_s3_object" "upload_webapp" {
      - bucket                 = "jowe.initialised.si" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "application/octet-stream" -> null
      - etag                   = "ffa0f76a470895dff99097ec9c618980" -> null
      - force_destroy          = false -> null
      - id                     = "static/js/106.44e68525.chunk.js.map" -> null
      - key                    = "static/js/106.44e68525.chunk.js.map" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./build//static/js/106.44e68525.chunk.js.map" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - version_id             = "n34Pcgiy413rPcPGfOnHo0u8akwgwcvY" -> null
    }

  # module.web.aws_s3_object.upload_webapp["static/js/106.74767f96.chunk.js"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + bucket                 = "jowe.initialised.si"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/javascript"
      + etag                   = "2a671af63604493ca8eb6af138f185b6"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/js/106.74767f96.chunk.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/js/106.74767f96.chunk.js"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.web.aws_s3_object.upload_webapp["static/js/106.74767f96.chunk.js.map"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + bucket                 = "jowe.initialised.si"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "a013b981d84d628e37bb579ba5a40cb6"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/js/106.74767f96.chunk.js.map"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/js/106.74767f96.chunk.js.map"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.web.aws_s3_object.upload_webapp["static/js/777.3fc69ada.chunk.js"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + bucket                 = "jowe.initialised.si"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/javascript"
      + etag                   = "5471791775fa3fb2f34292fa04ee78b7"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/js/777.3fc69ada.chunk.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/js/777.3fc69ada.chunk.js"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.web.aws_s3_object.upload_webapp["static/js/777.3fc69ada.chunk.js.map"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + bucket                 = "jowe.initialised.si"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "16d187c880b27b3a27c95fd60cb93649"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/js/777.3fc69ada.chunk.js.map"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/js/777.3fc69ada.chunk.js.map"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.web.aws_s3_object.upload_webapp["static/js/777.beec4e33.chunk.js"] will be destroyed
  # (because key ["static/js/777.beec4e33.chunk.js"] is not in for_each map)
  - resource "aws_s3_object" "upload_webapp" {
      - bucket                 = "jowe.initialised.si" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "ef60bb2da1a97fd42fc0a630e9524153" -> null
      - force_destroy          = false -> null
      - id                     = "static/js/777.beec4e33.chunk.js" -> null
      - key                    = "static/js/777.beec4e33.chunk.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./build//static/js/777.beec4e33.chunk.js" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - version_id             = "pOU78itTsjlDKKhCvjgoU6kr0X.i.VRF" -> null
    }

  # module.web.aws_s3_object.upload_webapp["static/js/777.beec4e33.chunk.js.map"] will be destroyed
  # (because key ["static/js/777.beec4e33.chunk.js.map"] is not in for_each map)
  - resource "aws_s3_object" "upload_webapp" {
      - bucket                 = "jowe.initialised.si" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "application/octet-stream" -> null
      - etag                   = "fe7520028a6e3c50a5dd798017ad98e9" -> null
      - force_destroy          = false -> null
      - id                     = "static/js/777.beec4e33.chunk.js.map" -> null
      - key                    = "static/js/777.beec4e33.chunk.js.map" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./build//static/js/777.beec4e33.chunk.js.map" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - version_id             = "5sRa8wwGKF0bkEbYs9LnVVsLLGnqG3VM" -> null
    }

  # module.web.aws_s3_object.upload_webapp["static/js/915.2b20329f.chunk.js"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + bucket                 = "jowe.initialised.si"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/javascript"
      + etag                   = "c06d9f8890056a09e0770151536fd20a"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/js/915.2b20329f.chunk.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/js/915.2b20329f.chunk.js"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.web.aws_s3_object.upload_webapp["static/js/915.2b20329f.chunk.js.map"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + bucket                 = "jowe.initialised.si"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "a8020211c626604acd9657c1c1740efd"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/js/915.2b20329f.chunk.js.map"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/js/915.2b20329f.chunk.js.map"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.web.aws_s3_object.upload_webapp["static/js/915.45e13d48.chunk.js"] will be destroyed
  # (because key ["static/js/915.45e13d48.chunk.js"] is not in for_each map)
  - resource "aws_s3_object" "upload_webapp" {
      - bucket                 = "jowe.initialised.si" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "089d4c60b48d715f24de0cf3b3670f25" -> null
      - force_destroy          = false -> null
      - id                     = "static/js/915.45e13d48.chunk.js" -> null
      - key                    = "static/js/915.45e13d48.chunk.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./build//static/js/915.45e13d48.chunk.js" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - version_id             = "Hl4VFP3Xf3BF0uufyJ02dGo0jlt6TVIN" -> null
    }

  # module.web.aws_s3_object.upload_webapp["static/js/915.45e13d48.chunk.js.map"] will be destroyed
  # (because key ["static/js/915.45e13d48.chunk.js.map"] is not in for_each map)
  - resource "aws_s3_object" "upload_webapp" {
      - bucket                 = "jowe.initialised.si" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "application/octet-stream" -> null
      - etag                   = "e06dedc8c4c810717da50c3e0855ba06" -> null
      - force_destroy          = false -> null
      - id                     = "static/js/915.45e13d48.chunk.js.map" -> null
      - key                    = "static/js/915.45e13d48.chunk.js.map" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./build//static/js/915.45e13d48.chunk.js.map" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - version_id             = "KCmIUAdFBEXU1bF4HSb2lo.2nYLIHVj8" -> null
    }

  # module.web.aws_s3_object.upload_webapp["static/js/main.a5e5d1a6.js"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + bucket                 = "jowe.initialised.si"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/javascript"
      + etag                   = "1af84f9b42edd3fbcde5bf41759e1205"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/js/main.a5e5d1a6.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/js/main.a5e5d1a6.js"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.web.aws_s3_object.upload_webapp["static/js/main.a5e5d1a6.js.LICENSE.txt"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + bucket                 = "jowe.initialised.si"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "text/plain; charset=utf-8"
      + etag                   = "9851f1b8c0c24b33f9a190b2a8d11b66"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/js/main.a5e5d1a6.js.LICENSE.txt"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/js/main.a5e5d1a6.js.LICENSE.txt"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.web.aws_s3_object.upload_webapp["static/js/main.a5e5d1a6.js.map"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + bucket                 = "jowe.initialised.si"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "0be7938c67b9f29124b962ddc9850bf0"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/js/main.a5e5d1a6.js.map"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/js/main.a5e5d1a6.js.map"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.web.aws_s3_object.upload_webapp["static/js/main.ed7dfa3d.js"] will be destroyed
  # (because key ["static/js/main.ed7dfa3d.js"] is not in for_each map)
  - resource "aws_s3_object" "upload_webapp" {
      - bucket                 = "jowe.initialised.si" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "3a25a0d4eba46757c36fa6567a837f1d" -> null
      - force_destroy          = false -> null
      - id                     = "static/js/main.ed7dfa3d.js" -> null
      - key                    = "static/js/main.ed7dfa3d.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./build//static/js/main.ed7dfa3d.js" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - version_id             = "GsV1QNQUIIixvtM1xmMr9PFmMaOBPSZV" -> null
    }

  # module.web.aws_s3_object.upload_webapp["static/js/main.ed7dfa3d.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/main.ed7dfa3d.js.LICENSE.txt"] is not in for_each map)
  - resource "aws_s3_object" "upload_webapp" {
      - bucket                 = "jowe.initialised.si" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "text/plain; charset=utf-8" -> null
      - etag                   = "9851f1b8c0c24b33f9a190b2a8d11b66" -> null
      - force_destroy          = false -> null
      - id                     = "static/js/main.ed7dfa3d.js.LICENSE.txt" -> null
      - key                    = "static/js/main.ed7dfa3d.js.LICENSE.txt" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./build//static/js/main.ed7dfa3d.js.LICENSE.txt" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - version_id             = "ce23LqjdNA2jQPB2wTLeVxOvc703eQRU" -> null
    }

  # module.web.aws_s3_object.upload_webapp["static/js/main.ed7dfa3d.js.map"] will be destroyed
  # (because key ["static/js/main.ed7dfa3d.js.map"] is not in for_each map)
  - resource "aws_s3_object" "upload_webapp" {
      - bucket                 = "jowe.initialised.si" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "application/octet-stream" -> null
      - etag                   = "107709ed63aa3e19ffa2e8f8ab46cd92" -> null
      - force_destroy          = false -> null
      - id                     = "static/js/main.ed7dfa3d.js.map" -> null
      - key                    = "static/js/main.ed7dfa3d.js.map" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./build//static/js/main.ed7dfa3d.js.map" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - version_id             = "qhxHv8irOzst7MZR4RhIJlwvkeZfAdNx" -> null
    }

Plan: 17 to add, 2 to change, 17 to destroy.

```

</details>

*Pushed by: @Andrej988, Action: `pull_request`*